In [2]:
import numpy as np
import pandas as pd

# 10 minutes to pandas

In [4]:
# Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns
s = pd.Series([1, 3, 5, np.nan, 6, 8])
display(s)

dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

                   A         B         C         D
2013-01-01 -0.346722  0.299350  0.645887 -1.128167
2013-01-02 -0.777768  1.036323  1.661083 -0.035403
2013-01-03  0.818925 -0.860365 -1.273971 -0.510052
2013-01-04  0.930610  0.194529  0.935011  1.540461
2013-01-05  0.622405 -0.383179  0.564324  0.586594
2013-01-06 -0.250156  1.639043  1.678385  1.200636

In [21]:
# Geting
display(df[0:1])
df['A']
# getting 的方式是选择列，或者指定行

                   A        B         C         D
2013-01-01 -0.346722  0.29935  0.645887 -1.128167

pandas.core.frame.DataFrame

In [35]:
# Selection
display(df.loc[dates[0]])
## loc 可以通过 dates[slice] 选中行（和 getting 作用一样）
display(df.loc['20130102':'20130104', ['A', 'B']])
## 可以做更复杂的区间选择
df.at[dates[0],'A']
## 如果是定义一行一列的数值，使用 .at 更加高效

# Index Selection  .iloc .iat 内容相似

A   -0.346722
B    0.299350
C    0.645887
D   -1.128167
Name: 2013-01-01 00:00:00, dtype: float64

                   A         B
2013-01-02 -0.777768  1.036323
2013-01-03  0.818925 -0.860365
2013-01-04  0.930610  0.194529

-0.3467219286155374

In [37]:
# Bollean indexing
## Using a single column’s values to select data.
display(df[df['A'] > 0])
## Selecting values from a DataFrame where a boolean condition is met.
display(df[df > 0])

                   A         B         C         D
2013-01-03  0.818925 -0.860365 -1.273971 -0.510052
2013-01-04  0.930610  0.194529  0.935011  1.540461
2013-01-05  0.622405 -0.383179  0.564324  0.586594

                   A         B         C         D
2013-01-01       NaN  0.299350  0.645887       NaN
2013-01-02       NaN  1.036323  1.661083       NaN
2013-01-03  0.818925       NaN       NaN       NaN
2013-01-04  0.930610  0.194529  0.935011  1.540461
2013-01-05  0.622405       NaN  0.564324  0.586594
2013-01-06       NaN  1.639043  1.678385  1.200636

In [40]:
## isin for filter
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
display(df2)
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D      E
2013-01-01 -0.346722  0.299350  0.645887 -1.128167    one
2013-01-02 -0.777768  1.036323  1.661083 -0.035403    one
2013-01-03  0.818925 -0.860365 -1.273971 -0.510052    two
2013-01-04  0.930610  0.194529  0.935011  1.540461  three
2013-01-05  0.622405 -0.383179  0.564324  0.586594   four
2013-01-06 -0.250156  1.639043  1.678385  1.200636  three

                   A         B         C         D     E
2013-01-03  0.818925 -0.860365 -1.273971 -0.510052   two
2013-01-05  0.622405 -0.383179  0.564324  0.586594  four

In [47]:
# Setting
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
df['F'] = s1
df.at[dates[0], 'A'] = 0
df.iat[0, 1] = 0
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.645887  5  NaN
2013-01-02 -0.777768  1.036323  1.661083  5  1.0
2013-01-03  0.818925 -0.860365 -1.273971  5  2.0
2013-01-04  0.930610  0.194529  0.935011  5  3.0
2013-01-05  0.622405 -0.383179  0.564324  5  4.0
2013-01-06 -0.250156  1.639043  1.678385  5  5.0

In [48]:
## A where operation with setting
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.645887 -5  NaN
2013-01-02 -0.777768 -1.036323 -1.661083 -5 -1.0
2013-01-03 -0.818925 -0.860365 -1.273971 -5 -2.0
2013-01-04 -0.930610 -0.194529 -0.935011 -5 -3.0
2013-01-05 -0.622405 -0.383179 -0.564324 -5 -4.0
2013-01-06 -0.250156 -1.639043 -1.678385 -5 -5.0

In [49]:
# Missing Data
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.645887  5  NaN  1.0
2013-01-02 -0.777768  1.036323  1.661083  5  1.0  1.0
2013-01-03  0.818925 -0.860365 -1.273971  5  2.0  NaN
2013-01-04  0.930610  0.194529  0.935011  5  3.0  NaN

In [50]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.777768  1.036323  1.661083  5  1.0  1.0

In [52]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.645887  5  5.0  1.0
2013-01-02 -0.777768  1.036323  1.661083  5  1.0  1.0
2013-01-03  0.818925 -0.860365 -1.273971  5  2.0  5.0
2013-01-04  0.930610  0.194529  0.935011  5  3.0  5.0

In [53]:
## To get the boolean mask where values are nan.
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [55]:
# Apply
display(df.apply(np.cumsum))
df.apply(lambda x: x.max() - x.min())

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.645887   5   NaN
2013-01-02 -0.777768  1.036323  2.306970  10   1.0
2013-01-03  0.041157  0.175958  1.032999  15   3.0
2013-01-04  0.971766  0.370487  1.968010  20   6.0
2013-01-05  1.594171 -0.012692  2.532334  25  10.0
2013-01-06  1.344015  1.626351  4.210719  30  15.0

A    1.708378
B    2.499407
C    2.952355
D    0.000000
F    4.000000
dtype: float64

In [59]:
# Pivot
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                   'B': ['A', 'B', 'C'] * 4,
                   'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D': np.random.randn(12),
                   'E': np.random.randn(12)})
display(df)
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

        A  B    C         D         E
0     one  A  foo  0.126654  1.180422
1     one  B  foo -1.128333 -0.246008
2     two  C  foo  0.744371 -0.027171
3   three  A  bar -1.630838 -0.779543
4     one  B  bar -2.904670 -0.484011
5     one  C  bar -0.478110 -0.564997
6     two  A  foo  0.886608 -0.223945
7   three  B  foo  1.509315  1.315217
8     one  C  foo  1.393234 -0.836877
9     one  A  bar -0.654293  0.649166
10    two  B  bar  0.655556  0.299326
11  three  C  bar  1.324065  1.001443

C             bar       foo
A     B
one   A -0.654293  0.126654
      B -2.904670 -1.128333
      C -0.478110  1.393234
three A -1.630838       NaN
      B       NaN  1.509315
      C  1.324065       NaN
two   A       NaN  0.886608
      B  0.655556       NaN
      C       NaN  0.744371

In [61]:
# Categoricals
df = pd.DataFrame({"id": [1, 2, 3, 4, 5, 6], "raw_grade": ['a', 'b', 'b', 'a', 'a', 'e']})
df["grade"] = df["raw_grade"].astype("category")
df["grade"].cat.categories = ["very good", "good", "very bad"]
## set categories naeme (inplace)
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): [very good, good, very bad]

In [65]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
display(df["grade"])
## cate 可以指定候选，顺序敏感
display(df["grade"].cat.categories)
display(df.sort_values(by="grade"))
## 所以可以用来 sort_values
df.groupby("grade").size()
## Grouping by a categorical column also shows empty categories.

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

Index(['very bad', 'bad', 'medium', 'good', 'very good'], dtype='object')

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

# Categorical data

In [77]:
df = pd.DataFrame({'A': list('abca'), 'B': list('bccd')}, dtype="category")
display(df.A)

# In the examples above where we passed dtype='category', we used the default behavior:
## Categories are inferred from the data.
## Categories are unordered.
# To control those behaviors, instead of passing 'category', use an instance of CategoricalDtype.

from pandas.api.types import CategoricalDtype

s = pd.Series(["a", "b", "c", "a"])
cat_type = CategoricalDtype(categories=["b", "c", "d"], ordered=True)
s_cat = s.astype(cat_type)
s_cat

0    a
1    b
2    c
3    a
Name: A, dtype: category
Categories (3, object): [a, b, c]

0    NaN
1      b
2      c
3    NaN
dtype: category
Categories (3, object): [b < c < d]

In [78]:
# Similarly, a CategoricalDtype can be used with a DataFrame to ensure that categories are consistent among all columns.
df = pd.DataFrame({'A': list('abca'), 'B': list('bccd')})
cat_type = CategoricalDtype(categories=list('abcd'), ordered=True)
df_cat = df.astype(cat_type)
df_cat['A']

0    a
1    b
2    c
3    a
Name: A, dtype: category
Categories (4, object): [a < b < c < d]

In [83]:
# If you already have codes and categories, you can use the from_codes() constructor to save the factorize step during normal constructor mode:
splitter = np.random.choice([0, 1], 5, p=[0.5, 0.5])
print(splitter)
s = pd.Series(pd.Categorical.from_codes(splitter, categories=["train", "test"]))
s

[0 1 0 1 1]

0    train
1     test
2    train
3     test
4     test
dtype: category
Categories (2, object): [train, test]

In [90]:
# Using describe() on categorical data will produce similar output to a Series or DataFrame of type string.
cat = pd.Categorical(["a", "c", "c", np.nan], categories=["b", "a", "c"])
df = pd.DataFrame({"cat": cat, "s": ["a", "c", "c", np.nan]})
display(df.describe())
display(df.cat.describe())
display(df.s.describe())

       cat  s
count    3  3
unique   2  2
top      c  c
freq     2  2

count     3
unique    2
top       c
freq      2
Name: cat, dtype: object

count     3
unique    2
top       c
freq      2
Name: s, dtype: object

TypeError: 'Series' object is not callable

# Computational tools

# Cookbook

# Essential basic funtionality

# Group By: split-apply-combine

# Intro to data structures

# Merge, join, and concatenate

# MultiIndex / advanced indexing

# Options and settings

In [68]:
df = pd.DataFrame(np.random.randn(5, 10))
pd.set_option('expand_frame_repr', True)
df

,0,1,2,3,4,5,6,7,8,9
0,-0.580396,2.079917,-0.561616,0.534423,0.478091,-0.868838,-0.961781,0.854575,-0.780192,0.053019
1,-0.961177,0.295044,0.177188,0.573755,-0.101381,-0.826728,-1.283182,-0.734123,0.293173,2.614904
2,-0.724993,0.322100,0.642258,-0.968539,0.997554,-0.722724,0.157123,1.691762,-0.126508,0.881066
3,0.674528,-0.798725,1.131376,0.448847,1.645049,1.197712,0.513692,-0.264288,0.677016,-2.701145
4,-0.025491,0.611244,0.343281,1.124285,0.549947,-0.632850,1.848184,0.118056,-0.025805,-0.758532

In [72]:
pd.set_option('expand_frame_repr', False)
display(df)
pd.reset_option('expand_frame_repr')

          0         1         2         3         4         5         6         7         8         9
0 -0.580396  2.079917 -0.561616  0.534423  0.478091 -0.868838 -0.961781  0.854575 -0.780192  0.053019
1 -0.961177  0.295044  0.177188  0.573755 -0.101381 -0.826728 -1.283182 -0.734123  0.293173  2.614904
2 -0.724993  0.322100  0.642258 -0.968539  0.997554 -0.722724  0.157123  1.691762 -0.126508  0.881066
3  0.674528 -0.798725  1.131376  0.448847  1.645049  1.197712  0.513692 -0.264288  0.677016 -2.701145
4 -0.025491  0.611244  0.343281  1.124285  0.549947 -0.632850  1.848184  0.118056 -0.025805 -0.758532

# Reshaping and pivot tables

# Scaling to large datasets

# Styling

# Time series / date functionality

# Working with missing data

# Working with text data